In [1]:
import pandas as pd
from sqlalchemy import create_engine

### Extract CSVs into DataFrames

In [25]:
sales_file = "../Resources/Alcohol sales.csv"
sales_df = pd.read_csv(sales_file)
sales_df.head()

       DATE  S4248SM144NCEN
0  1/1/1992            3459
1  2/1/1992            3458
2  3/1/1992            4002
3  4/1/1992            4564
4  5/1/1992            4221

In [72]:
weather_file = "../Resources/Weather Data.csv"
weather_df = pd.read_csv(weather_file)
weather_df = weather_df.drop([0,1,2,3])
weather_df.head(1000)

    Contiguous U.S.  Average Temperature Unnamed: 1 Unnamed: 2
4                                 200001      33.57       3.45
5                                 200002      39.78       5.96
6                                 200003      46.04       4.54
7                                 200004      52.59       1.54
8                                 200005      63.14       2.94
..                                   ...        ...        ...
239                               201908      73.74       1.64
240                               201909      68.43       3.57
241                               201910      52.05      -2.06
242                               201911      41.14      -0.55
243                               201912      36.45       3.77

[240 rows x 3 columns]

### Transform premise DataFrame

In [71]:
# Create a filtered dataframe from specific columns
sales_cols = ["DATE", "S4248SM144NCEN"]
sales_transformed= sales_df[sales_cols].copy()

#Rename the column headers
sales_transformed = sales_transformed.rename(columns={"DATE": "YearMonth",
                                                          "S4248SM144NCEN": "Sales"
                                                           })
 
# Clean the data by dropping duplicates and setting the index
#sales_transformed.drop_duplicates("DATE", inplace=True)
#sales_transformed.set_index("DATE", inplace=True)

sales_transformed.head(1000)

     YearMonth  Sales
0     1/1/1992   3459
1     2/1/1992   3458
2     3/1/1992   4002
3     4/1/1992   4564
4     5/1/1992   4221
..         ...    ...
330   7/1/2019  13724
331   8/1/2019  14464
332   9/1/2019  13215
333  10/1/2019  14680
334  11/1/2019  13983

[335 rows x 2 columns]

### Transform county DataFrame

In [70]:
weather_cols = ["Contiguous U.S.  Average Temperature", "Unnamed: 1"]
 
weather_transformed = weather_df[weather_cols].copy()

# Rename the column headers
weather_transformed = weather_transformed.rename(columns={"Contiguous U.S.  Average Temperature": "YearMonth",
                                                         "Unnamed: 1": "AverageTemp"})
#YearMonth = YearMonth+'01' 

# Set index
#weather_transformed.set_index("id", inplace=True)

weather_transformed.head()

NameError: name 'YearMonth' is not defined

### Create database connection

In [66]:
connection_string = "postgres:postgres@localhost:5432/weather_db"
engine = create_engine(f'postgresql://{connection_string}')

In [67]:
# Confirm tables
engine.table_names()

[]

### Load DataFrames into database

In [68]:
sales_transformed.to_sql(name='sales', con=engine, if_exists='append', index=True)

In [69]:
weather_transformed.to_sql(name='weather', con=engine, if_exists='append', index=True)